backend/lib/services/LocationSunriseSunset.rb

SELECT "location_dates".* FROM "location_dates" WHERE "location_dates"."location_id" = 26 AND "location_dates"."date" IN ('2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05', '2025-06-06', '2025-06-07')
---
    def fetch_and_store_history
      all_dates_in_range = (@start_date..@end_date).to_a

      existing_location_dates = @location.location_dates
                                        .where(date: all_dates_in_range)
                                        .index_by(&:date)

INSERT INTO "location_dates" ("location_id","date","sunrise","sunset","golden_hour","created_at","updated_at") VALUES (12, '2025-05-14', '6:18:51 AM', '5:52:55 PM', '5:23:13 PM', '2025-05-22 23:27:09.893382', '2025-05-22 23:27:09.893408'), (12, '2025-05-15', '6:19:06 AM', '5:52:43 PM', '5:22:58 PM', '2025-05-22 23:27:09.893446', '2025-05-22 23:27:09.893449'), (12, '2025-05-16', '6:19:21 AM', '5:52:32 PM', '5:22:44 PM', '2025-05-22 23:27:09.893512', '2025-05-22 23:27:09.893517'), (12, '2025-05-17', '6:19:36 AM', '5:52:21 PM', '5:22:31 PM', '2025-05-22 23:27:09.893531', '2025-05-22 23:27:09.893534'), (12, '2025-05-18', '6:19:51 AM', '5:52:12 PM', '5:22:19 PM', '2025-05-22 23:27:09.893555', '2025-05-22 23:27:09.893557'), (12, '2025-05-19', '6:20:07 AM', '5:52:03 PM', '5:22:08 PM', '2025-05-22 23:27:09.893630', '2025-05-22 23:27:09.893634'), (12, '2025-05-20', '6:20:22 AM', '5:51:55 PM', '5:21:57 PM', '2025-05-22 23:27:09.893649', '2025-05-22 23:27:09.893651'), (12, '2025-05-21', '6:20:38 AM', '5:51:48 PM', '5:21:47 PM', '2025-05-22 23:27:09.893665', '2025-05-22 23:27:09.893667'), (12, '2025-05-22', '6:20:54 AM', '5:51:41 PM', '5:21:38 PM', '2025-05-22 23:27:09.893713', '2025-05-22 23:27:09.893718') ON CONFLICT  DO NOTHING RETURNING "id"
SELECT "location_dates".* FROM "location_dates" WHERE "location_dates"."location_id" = 26 AND "location_dates"."date" IN ('2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05', '2025-06-06', '2025-06-07')
---
          end

          if records_to_create.any?
            LocationDate.insert_all(records_to_create)
            newly_created_records = @location.location_dates
                                             .where(date: records_to_create.map { |r| r[:date] })
                                             .index_by(&:date)