backend/lib/services/location_history.rb

    def fetch_and_store_history
      all_dates_in_range = (@start_date..@end_date).to_a

      existing_location_dates = @location.location_dates
                                        .where(date: all_dates_in_range)
                                        .index_by(&:date)
---
SELECT "location_dates".* FROM "location_dates" WHERE "location_dates"."location_id" = 11 AND "location_dates"."date" IN ('2025-05-07', '2025-05-08', '2025-05-09', '2025-05-10', '2025-05-11', '2025-05-12', '2025-05-13', '2025-05-14', '2025-05-15', '2025-05-16', '2025-05-17', '2025-05-18', '2025-05-19', '2025-05-20', '2025-05-21', '2025-05-22', '2025-05-23', '2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27', '2025-05-28', '2025-05-29', '2025-05-30', '2025-05-31', '2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05', '2025-06-06', '2025-06-07', '2025-06-08', '2025-06-09', '2025-06-10', '2025-06-11')

        end

        if records_to_create.any?
          LocationDate.insert_all(records_to_create)
          # Re-fetch to update existing_location_dates with newly created ones
          newly_created_records = @location.location_dates
                                           .where(date: records_to_create.map { |r| r[:date] })
                                           .index_by(&:date)
---
INSERT INTO "location_dates" ("location_id","date","sunrise","sunset","golden_hour","created_at","updated_at") VALUES (23, '2025-05-15', '6:59:55 AM', '9:25:11 PM', '8:46:12 PM', '2025-05-23 23:46:57.177935', '2025-05-23 23:46:57.177964'), (23, '2025-05-16', '6:59:00 AM', '9:26:09 PM', '8:47:05 PM', '2025-05-23 23:46:57.177983', '2025-05-23 23:46:57.177986'), (23, '2025-05-17', '6:58:07 AM', '9:27:06 PM', '8:47:57 PM', '2025-05-23 23:46:57.177999', '2025-05-23 23:46:57.178001'), (23, '2025-05-18', '6:57:15 AM', '9:28:03 PM', '8:48:49 PM', '2025-05-23 23:46:57.178013', '2025-05-23 23:46:57.178015'), (23, '2025-05-19', '6:56:25 AM', '9:29:00 PM', '8:49:40 PM', '2025-05-23 23:46:57.178029', '2025-05-23 23:46:57.178031'), (23, '2025-05-20', '6:55:37 AM', '9:29:56 PM', '8:50:30 PM', '2025-05-23 23:46:57.178045', '2025-05-23 23:46:57.178047'), (23, '2025-05-21', '6:54:51 AM', '9:30:51 PM', '8:51:20 PM', '2025-05-23 23:46:57.178061', '2025-05-23 23:46:57.178063'), (23, '2025-05-22', '6:54:06 AM', '9:31:45 PM', '8:52:09 PM', '2025-05-23 23:46:57.178078', '2025-05-23 23:46:57.178080'), (23, '2025-05-23', '6:53:23 AM', '9:32:38 PM', '8:52:58 PM', '2025-05-23 23:46:57.178095', '2025-05-23 23:46:57.178097') ON CONFLICT  DO NOTHING RETURNING "id"
SELECT "location_dates".* FROM "location_dates" WHERE "location_dates"."location_id" = 11 AND "location_dates"."date" IN ('2025-05-07', '2025-05-08', '2025-05-09', '2025-05-10', '2025-05-11', '2025-05-12', '2025-05-13', '2025-05-14', '2025-05-15', '2025-05-16', '2025-05-17', '2025-05-18', '2025-05-19', '2025-05-20', '2025-05-21', '2025-05-22', '2025-05-23', '2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27', '2025-05-28', '2025-05-29', '2025-05-30', '2025-05-31', '2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04', '2025-06-05', '2025-06-06', '2025-06-07', '2025-06-08', '2025-06-09', '2025-06-10', '2025-06-11')